InformationRegisters/ТоварыНаККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ТоварыНаККМ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалоговаяГруппа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Делимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Comment>Сокращенное наименование, для ККМ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Код</Name>
					<Comment>Код РРО</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТоварыНаККМ/Ext/RecordSetModule.bsl
// Обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, Замещение)
	
	Перем Описание;
	
	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка заполнения реквизитов.
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Не ЗначениеЗаполнено(Запись.Номенклатура) Тогда
			ОбщегоНазначения.СообщитьОбНезаполненомРесурсеРегистра(ЭтотОбъект, "Номенклатура", Отказ);
		КонецЕсли;
		Если Запись.Номенклатура.Набор Тогда
			ОбщегоНазначения.СообщитьОбОшибкеЗапеисиРегистра("В регистре сведений «" + Метаданные.РегистрыСведений.ТоварыНаККМ.Синоним + "» не допускается использование наборов.", Отказ, ,, ЭтотОбъект);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Запись.ЕдиницаИзмерения) Тогда
			ОбщегоНазначения.СообщитьОбНезаполненомРесурсеРегистра(ЭтотОбъект, "ЕдиницаИзмерения", Отказ);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Запись.НаименованиеСокращенное) Тогда
			ОбщегоНазначения.СообщитьОбНезаполненомРеквизитеРегистра(ЭтотОбъект, "НаименованиеСокращенное", Отказ);
		КонецЕсли;
		
		Если Отказ Тогда
			 Возврат;
		КонецЕсли;
	КонецЦикла;

	// Проверка корректности данных.
	Для Каждого Запись Из ЭтотОбъект Цикл
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ВЫБОР
		                      |		КОГДА РегТовары.Код = &Код
		                      |			ТОГДА ИСТИНА
		                      |		ИНАЧЕ ЛОЖЬ
		                      |	КОНЕЦ КАК НеУникальныйКод,
		                      |	ПРЕДСТАВЛЕНИЕ(&КассаККМ) КАК КассаККМ,
		                      |	ПРЕДСТАВЛЕНИЕ(РегТовары.Код) КАК Код,
		                      |	ПРЕДСТАВЛЕНИЕ(РегТовары.Номенклатура) КАК Номенклатура,
		                      |	ПРЕДСТАВЛЕНИЕ(РегТовары.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
		                      |	РегТовары.НаименованиеСокращенное КАК НаименованиеСокращенное
		                      |ИЗ
		                      |	РегистрСведений.ТоварыНаККМ КАК РегТовары
		                      |ГДЕ
		                      |	РегТовары.КассаККМ = &КассаККМ
		                      |	И (РегТовары.Код = &Код
		                      |			ИЛИ РегТовары.Номенклатура = &Номенклатура
		                      |				И РегТовары.ЕдиницаИзмерения = &ЕдиницаИзмерения
		                      |				И РегТовары.НаименованиеСокращенное = &НаименованиеСокращенное)");
		Запрос.УстановитьПараметр("Код", Запись.Код);
		Запрос.УстановитьПараметр("КассаККМ", Запись.КассаККМ);
		Запрос.УстановитьПараметр("Номенклатура", Запись.Номенклатура);
		Запрос.УстановитьПараметр("ЕдиницаИзмерения", Запись.ЕдиницаИзмерения);
		Запрос.УстановитьПараметр("НаименованиеСокращенное", Запись.НаименованиеСокращенное);
		Выборка = Запрос.Выполнить();
		Если Выборка.Пустой() Тогда
			Продолжить;
		КонецЕсли;
		
		Выборка = Выборка.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.НеУникальныйКод Тогда
				Ошибка = "Товары с таким значением кода для данной кассы уже существуют:"
			Иначе
				Ошибка = "Товары с таким набором данных для данной кассы уже существуют:"
			КонецЕсли;
			Ошибка = Ошибка + Символы.ПС +
					 "       Касса: " + Выборка.КассаККМ + Символы.ПС +
					 "       Код: " + Выборка.Код + Символы.ПС +
					 "       Номенклатура: " + Выборка.Номенклатура + Символы.ПС +
					 "       Сокращенное наименование: " + Выборка.НаименованиеСокращенное + Символы.ПС +
					 "       Единица измерения: " + Выборка.ЕдиницаИзмерения;
			Если ПустаяСтрока(Описание) Тогда
				Описание = " - " + Ошибка;				 
			Иначе
				Описание = Описание + Символы.ПС + " - " + Ошибка;				 
			КонецЕсли;
		КонецЦикла;
		ОбщегоНазначения.СообщитьОбОшибкеЗапеисиРегистра(Описание, Отказ, ,, ЭтотОбъект);
		
		Если Отказ Тогда
			 Возврат;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПередЗаписью()
